% 对于投资问题，收益可用年收益率的期望表示，风险可用收益的方差表示
% 对于不同股票的相关程度，则可用协方差来表示（协方差越大，可能性越大
% 总体方差=各自方差+协方差

data=[0.3	0.225	0.149
0.103	0.29	0.26
0.216	0.216	0.419
-0.056	-0.272	-0.078
-0.071	0.144	0.169
0.056	0.107	-0.035
0.038	0.321	0.133
0.089	0.305	0.732
0.09	0.195	0.021
0.083	0.39	0.131
0.035	-0.072	0.006
0.176	0.715	0.908];
A=data(:,1);
B=data(:,2);
C=data(:,3);
mu_A=mean(A);
mu_B=mean(B);
mu_C=mean(C);
S=cov(data);
f = @(x) x'*S*x;
con = @(x) con_fun(x, mu_A, mu_B, mu_C); % con只传入x这一个变量，避免参数数量不匹配
[x,y] = fmincon(f,rand(3,1),[],[],[1,1,1],1,zeros(3,1),[],con);

function [c,ceq] = con_fun(x,mu_A,mu_B,mu_C)
    c = 0.15-(mu_A*x(1)+mu_B*x(2)+mu_C*x(3));
    ceq = [];
end