% 熵权法的核心：根据各指标的变异程度，计算出各指标的熵权，进而得到个指标的权重
% 一个指标如果能让不同样本的数值差异越大，说明该指标越能有效区分样本的好坏，则赋予更高的权重
% 要注意先对数据进行预处理，都换成正项指标（值越大越好）

a=[93	66	86	88	77	71	90	94
97	99	61	61	75	87	70	70
65	99	94	71	91	86	80	93
97	79	98	61	92	66	88	69
85	92	87	63	67	64	96	98
63	65	91	93	80	80	99	74
71	77	90	88	78	99	82	68
82	97	76	73	86	73	65	70
99	92	86	98	89	83	66	85
99	99	67	61	90	69	70	79]; % aij为第i个评价对象关于第j个评价指标的取值
[n,m]=size(a);
for j=1:m
    p(:,j)=a(:,j)/sum(a(:,j)); % 指标比重矩阵p（pij为第i个评价对象关于第j个指标的比重）
    e(j)=-sum(p(:,j).*log(p(:,j)))/log(n); % 计算各项指标的熵值
                                           % ej越接近0，则该指标下样本的比重 p差异越大（ 样本间区分度越高），该指标越的权重就越高
end
g=1-e; % 差异系数，值越大，指标越重要
w=g/sum(g); % 计算各指标的权重
s=w*p';
[S,ind]=sort(s,'descend');