% 灰色关联分析常针对大量不确定因素及其相互关系
% 计算每个数据的灰色加权关联度，度越大说明评价效果越好
% 数据的数值越接近 1 越优，这是灰色关联度分析的前提

a=[0.83	 0.90	0.99	  0.92	0.87	  0.95
326	 295	 340  287	310	  303
21	 38	     25	  19	 27	  10
3.2	2.4	     2.2   2.0	 0.9   1.7
0.20	0.25	    0.12   0.33 	0.20	  0.09
0.15	0.20	    0.14   0.09	0.15   0.17
250	180	    300	   200	150   175
0.23	0.15	    0.27   0.30	0.18   0.26
0.87	0.95	    0.99	   0.89	0.82	  0.94];

for i=[1 5:1:9]    % 仅对第 1、5、6、7、8、9 行处理
    a(i,:)=(a(i,:)-min(a(i,:)))/(max(a(i,:))-min(a(i,:)));
end       % 对效益型指标进行标准化
for i=2:1:4 
   a(i,:)=(max(a(i,:))-a(i,:))/(max(a(i,:))-min(a(i,:))); 
end       % 对成本型指标进行标准化
[m,n]=size(a);

Cbest=max(a,[],2); % 对矩阵按行求最大值，返回一个和行数相同的列向量
t=repmat(ck,1,n)-a; % repmat(ck,1,n)：矩阵扩展函数，将最优参考序列9×1的列向量Cbest，扩展为 9×6的矩阵，每一列都是Cbest的复制
mmin=min(min(t)); 
mmax=max(max(t));
rho=0.5; %分辨系数，数值越大分辨率越大
xishu=(mmin+rho*mmax)./(t+rho*mmax); % 计算灰色关联系数
guanliandu=mean(xishu); % 根据个指标的权重计算灰色加权关联度，这里由于题目没有给出权重，默认去平均值
[gsort,ind]=sort(guanliandu,'descend');