% qqplot: 把样本数据的实际分位数和理论分布的理论分位数做一一对应，画成散点图
% 如果散点看起来像一条直线，则说明拟合效果好
% qqplot(a)：默认以标准正态分布 N (0,1)为理论分布画 Q-Q 图；
a=[141 148 132 138 154 142 150 146 155 158 150 140 147 148 144 150  140  147  148  144  150  149  145  149  158 143  141  144  144  126  140  144  142  141  140 145  135  147  146  141  136  140  146  142  137 148  154  137  139  143  140  131  143  141  149 148  135  148  152  143  144  141  143  147  146 150  132  142  142  143  153  149  146  149  138 142  149  142  137  134  144  146  147  140  142 140  137  152  145]';
a=a(~isnan(a)); % 去掉NaN值
pd=fitdist(a, 'Normal'); % 拟合正态分布，其中pd里存储 2 个关键值：均值（mu）和标准差（sigma）
% 其他分布：
% pd = fitdist(a, 'Uniform');    % 均匀分布
% pd = fitdist(a, 'Exponential');% 指数分布
% pd = fitdist(a, 'Gamma');      % 伽马分布
% pd = fitdist(a, 'Weibull');    % 威布尔分布
% pd = fitdist(a, 'Chi2');       % 卡方分布
% pd = fitdist(a, 'T');          % t分布
% pd = fitdist(a, 'F');          % F分布
qqplot(a,pd); % 使用拟合好的pd，绘制QQ图

hold on;
% 如果拟合的是函数模型，而不是数据分布，则计算各点的残差，看残差是否服从均值为 0 的正态分布
f=@(c,x) (1./(c(2).*sqrt(2*pi))) .* exp(-(x - c(1)).^2 ./ (2*c(2).^2));
lb=[0,0.01]; ub=[2,2];
n = length(a);
x0 = 1:1:n; 
x0 = x0';
y0 = a;
c = lsqcurvefit(f,rand(1,2),x0,y0,lb,ub);
y_fit = f(c, x0); % 模型拟合值
res = y0 - y_fit; % 残差 = 真实值 - 拟合值
pd_res = fitdist(res, 'Normal');
qqplot(res,pd_res);