% 对于一般的非线性规划问题（非凸规划），一般只能求得局部最优解，很难得到全局最优解
% 可以先画图进行可视化分析定位所有潜在极值区间，再针对每个极值区间设置初始值求解，最后比较得到全局最优解

% 无约束的非线性规划
% fminunc：目标函数可导
% fminsearch：目标函数连续但不可导或导数复杂

% 有约束的非线性规划
% fmincon
% optimproblem

f = @(x) x(1)^2+x(2)^2+x(3)^2+8;
[x,y] = fmincon(f,rand(3,1),[],[],[],[],zeros(3,1),[],@fun); % @fun为非线性约束函数句柄
% fun的格式为[c,ceq] = fun(x)
% x：和目标函数的输入一致
% c：非线性不等式约束，c<=0
% ceq：非线性等式约束，ceq=0
function [c,ceq]=fun(x)
c=[-x(1)^2+x(2)-x(3)^2;
   x(1)+x(2)^2+x(3)^3-20];
ceq=[-x(1)-x(2)^2+2;
     x(2)+2*x(3)^2-3];
end